Repository: Palolo875/one-lovely-bar
Catalog: lib/l10n/app_*.arb
Languages: fr

# tabMap
source: Map
fr: Carte

# tabItinerary
source: Itinerary
fr: Itinéraire

# tabHistory
source: History
fr: Historique

# tabProfile
source: Profile
fr: Profil

# searchDestination
source: Where are you going?
fr: Où allez-vous ?

# itineraryButton
source: Itinerary
fr: Itinéraire

# historyButton
source: History
fr: Historique

# weatherLayersTooltip
source: Weather layers
fr: Couches météo

# poisTooltip
source: Points of interest
fr: Points d'intérêt

# centerOnPosition
source: Center on my position
fr: Centrer sur ma position

# overlayStatusPrefix
source: Active overlays: {layers}
fr: Overlays actifs: {layers}

source: Weather layers
fr: Couches météo

source: Rain Radar
fr: Radar précipitations

source: Opacity
fr: Opacité

source: Wind
fr: Vent

# windOverlaySubtitle
source: Simple overlay (P0)
fr: Overlay simple (P0)

source: Temperature
fr: Température

# tempOverlaySubtitle
source: Simple overlay (P0)
fr: Overlay simple (P0)

# max3Layers
source: Max 3 active layers to keep the map readable.
fr: Max 3 couches actives pour garder la carte lisible.

# max3LayersError
source: Maximum 3 active layers.
fr: Maximum 3 couches actives.

source: Reset to profile
fr: Réinitialiser selon profil

# resetLayersFailed
source: Could not reset layers.
fr: Impossible de réinitialiser les couches.

source: Active overlays
fr: Overlays actifs

source: Points of Interest
fr: Points d'intérêt

source: Show POIs
fr: Afficher les POIs

source: Radius
fr: Rayon

# shelter
source: Shelters
fr: Abris

# hut
source: Huts
fr: Refuges

# weatherStation
source: Weather Stations
fr: Stations météo

source: Guidance
fr: Guidage

source: No instructions available.
fr: Aucune instruction disponible.

source: Close
fr: Fermer

source: Find shelters
fr: Trouver des abris

source: Follow enabled
fr: Suivi activé

source: Stop reading
fr: Arrêter la lecture

source: Read instructions
fr: Lire les instructions

source: No shelter
fr: Aucun abri

# noShelterMessage
source: No shelter found near you.
fr: Aucun abri trouvé autour de vous.

# shelterRadius
source: Shelter • radius 2.5 km
fr: Abri • rayon 2.5 km

# replaceGuidance
source: Replace guidance to this shelter
fr: Remplacer le guidage vers cet abri

# stackGuidance
source: Stack a new guidance
fr: Empiler un nouveau guidage

# remaining
source: Remaining: {value}
fr: Restant: {value}

# arrivalLabel
source: Arrival: {value}
fr: Arrivée: {value}

source: Route: error
fr: Route: erreur

source: Location unavailable.
fr: Localisation indisponible.

source: Itinerary
fr: Itinéraire

source: Departure / Arrival
fr: Départ / Arrivée

source: Use my position
fr: Utiliser ma position

source: Swap
fr: Inverser

source: Departure
fr: Départ

source: Arrival
fr: Arrivée

source: Search
fr: Rechercher

# fillInDepartureArrival
source: Fill in a departure and arrival to compute an itinerary.
fr: Renseignez un départ et une arrivée pour calculer un itinéraire.

source: Duration
fr: Durée

source: Elevation
fr: Dénivelé

source: Alerts
fr: Alertes

source: No alert
fr: Aucune alerte

# noAlertMessage
source: No alert detected for this departure.
fr: Aucune alerte détectée pour ce départ.

source: Alerts error
fr: Erreur alertes

source: Retry
fr: Réessayer

source: Weather timeline
fr: Timeline météo

source: Weather error
fr: Erreur météo

source: View simulation
fr: Voir simulation

source: Save
fr: Sauvegarder

# tripSaved
source: Trip saved to history.
fr: Trajet sauvegardé dans l'historique.

source: Open advanced simulation
fr: Ouvrir la simulation avancée

# profileAndSettings
source: Profile & settings
fr: Profil & paramètres

source: Active profile
fr: Profil actif

source: Appearance
fr: Apparence

source: Automatic
fr: Automatique

source: Light
fr: Clair

source: Dark
fr: Sombre

source: Units
fr: Unités

source: Speed
fr: Vitesse

source: Map
fr: Carte

source: OpenFreeMap (default)
fr: OpenFreeMap (par défaut)

# openFreeMapSubtitle
source: No SLA — fallback recommended
fr: Pas de SLA — fallback recommandé

# layerOrderTitle
source: Active layers order
fr: Ordre des couches actives

source: Active
fr: Actif

source: Adjustable opacity
fr: Opacité réglable

source: Weather alerts
fr: Alertes météo

# precipitationMmh
source: Rain (mm/h)
fr: Pluie (mm/h)

source: Wind (km/h)
fr: Vent (km/h)

# tempLowC
source: Low temp. (°C)
fr: Temp. basse (°C)

# tempHighC
source: High temp. (°C)
fr: Temp. haute (°C)

source: Reset
fr: Réinitialiser

source: Offline zones (MVP)
fr: Zones hors-ligne (MVP)

# addZone
source: Add a zone
fr: Ajouter une zone

# addZoneSubtitle
source: Center + radius (local persistence)
fr: Centre + rayon (persistance locale)

# zoneName
source: Name
fr: Nom

source: Offline zone
fr: Zone offline

# radiusKm
source: Radius: {value} km
fr: Rayon: {value} km

source: Add
fr: Ajouter

source: No zone configured
fr: Aucune zone configurée

# noZoneMessage
source: Add a zone to use the app offline (tiles + weather).
fr: Ajoutez une zone pour utiliser l'app hors-ligne (tuiles + météo).

# zoneDeleteFailed
source: Failed to delete the zone.
fr: Échec de la suppression de la zone.

# zoneInvalidParams
source: Invalid parameters for the offline zone.
fr: Paramètres invalides pour la zone hors-ligne.

# tripHistory
source: History
fr: Historique

source: Saved trips
fr: Trajets sauvegardés

source: Privacy
fr: Vie privée

# noAdditionalCollection
source: No additional data collection (MVP).
fr: Aucune collecte additionnelle (MVP).

source: Main profile
fr: Profil principal

source: New zone
fr: Nouvelle zone

source: Skip
fr: Passer

# weatherOnYourWay
source: Your weather, on your way
fr: Votre météo, sur votre chemin

# weatherOnYourWaySubtitle
source: Discover the weather exactly where you'll be, at the right time.
fr: Découvrez la météo exactement là où vous serez, au bon moment.

source: Choose your profile
fr: Choisissez votre profil

# adaptLayersAndAlerts
source: We adapt the weather layers and alerts to your usage.
fr: On adapte les couches météo et les alertes à votre usage.

source: Selected
fr: Sélectionné

source: Tap to choose
fr: Tap pour choisir

# permissionsDescription
source: Location allows centering the map and showing precise weather. Notifications are used to alert you in case of severe weather.
fr: La localisation permet de centrer la carte et d'afficher la météo exacte. Les notifications servent à vous prévenir en cas d'alerte météo.

source: Requesting…
fr: Demande en cours…

source: Authorize
fr: Autoriser

source: Start
fr: Commencer

# continueLabel
source: Continue
fr: Continuer

# chooseProfileToContinue
source: Choose a profile to continue.
fr: Choisissez un profil pour continuer.

# profileSaveFailed
source: Could not save your profile. Please try again.
fr: Impossible d'enregistrer votre profil. Réessayez.

# progressSaveFailed
source: Could not save your progress. Please try again.
fr: Impossible d'enregistrer votre progression. Réessayez.

# webPermissionsNote
source: On the web, the browser manages permissions. Trigger an action (center the map) to prompt the request.
fr: Sur Web, le navigateur gère les permissions. Lance une action (centrer la carte) pour déclencher la demande.

source: Permissions granted.
fr: Permissions accordées.

# permissionsDenied
source: Permissions denied. Open settings to enable them.
fr: Permissions refusées. Ouvre les réglages pour les activer.

# settingsLabel
source: Settings
fr: Réglages

# profileUniversal
source: Universal
fr: Universel

# profileCyclist
source: Cyclist
fr: Cycliste

# profileHiker
source: Hiker
fr: Randonneur

# profileDriver
source: Driver
fr: Conducteur

# profileNautical
source: Nautical
fr: Nautique

# profileParaglider
source: Paraglider
fr: Aéro

# profileCamper
source: Camper
fr: Campeur

# searchPlaceHint
source: Search a place…
fr: Rechercher un lieu…

# searchDestinationTitle
source: Destination search
fr: Recherche de destination

# searchHint
source: Type a place (e.g. "Paris", "Gare de Lyon").
fr: Tape un lieu (ex: "Paris", "Gare de Lyon").

source: No results
fr: Aucun résultat

# noResultsMessage
source: No place found. Try a more precise name.
fr: Aucun lieu trouvé. Essaie un nom plus précis.

source: Search error
fr: Erreur de recherche

source: No trip recorded
fr: Aucun trajet enregistré

# noTripMessage
source: Saved trips will appear here (GPX, distance, duration).
fr: Les trajets sauvegardés apparaîtront ici (GPX, distance, durée).

# recorded
source: Recorded: {value}
fr: Enregistré: {value}

# departureAt
source: Departure: {value}
fr: Départ: {value}

source: Weather on route
fr: Météo sur le trajet

source: Replan
fr: Replanifier

source: Departure time
fr: Heure de départ

source: Copy GPX
fr: Copier GPX

source: View instructions
fr: Voir instructions

# gpxCopied
source: GPX copied to clipboard.
fr: GPX copié dans le presse-papiers.

# weatherTimelineSampling
source: Weather timeline (route sampling)
fr: Timeline météo (échantillonnage du trajet)

source: Points preview
fr: Aperçu des points

source: Modify route
fr: Modifier le trajet

source: Routing error
fr: Erreur routing

source: Back to itinerary
fr: Retour à l'itinéraire

source: No point
fr: Aucun point

# noPointMessage
source: The route contains no point to display.
fr: Le trajet ne contient aucun point à afficher.

# pointsHidden
source: {count} points hidden
fr: {count} points masqués

source: Around you
fr: Autour de vous

source: Next 24h
fr: Prochaines 24h

source: Forecast unavailable
fr: Prévisions indisponibles

# forecastHourlyMessage
source: Could not load hourly forecasts at this time.
fr: Impossible de charger les prévisions horaires actuellement.

# forecast7days
source: 7-day forecast
fr: Prévisions 7 jours

# forecastDailyMessage
source: Could not load daily forecasts at this time.
fr: Impossible de charger les prévisions journalières actuellement.

source: For your profile
fr: Pour votre profil

# cyclistWindNote
source: Wind: {speed} km/h (useful for effort / headwind)
fr: Vent: {speed} km/h (utile pour l'effort / vent de face)

# driverPrecipNote
source: Precip.: {precip} mm (grip / visibility)
fr: Précip.: {precip} mm (adhérence / visibilité)

# genericWindUvNote
source: Wind: {speed} km/h • UV: {uv}
fr: Vent: {speed} km/h • UV: {uv}

# windMetric
source: Wind
fr: Vent

source: Detailed Weather
fr: Météo détaillée

# centerTarget
source: Center
fr: Centre

# weatherLoading
source: Loading...
fr: Chargement...

source: Weather unavailable
fr: Météo indisponible

source: Clear sky
fr: Ciel clair

source: Few clouds
fr: Peu nuageux

source: Cloudy
fr: Nuageux

source: Rain
fr: Pluie

source: Thunderstorm
fr: Orage

source: Error
fr: Erreur
